modules/News/Blocks/ListNews.php

select `core_news`.* from `core_news` where `core_news`.`status` = 'publish' and `core_news`.`deleted_at` is null group by `core_news`.`id` order by `core_news`.`id` desc limit 3
---
        $model_news->orderBy("core_news.".$model['order'], $model['order_by']);
        $model_news->where("core_news.status", "publish");
        $model_news->groupBy("core_news.id");
        return $model_news->with(['category'])->limit($model['number'])->get();